{
  "products": [
    {
      "id": "3",
      "title": "Mens Cotton",
      "price": "62",
      "description": "great outerwear jackets for Spring/Autumn/Winter, suitable for many occasions, such as working, hiking, camping, mountain/rock climbing, cycling, traveling or other outdoors. Good gift choice for you or your family member. A warm hearted love to Father, husband or son in this thanksgiving or Christmas Day.",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71li-ujtlUL._AC_UX679_.jpg",
      "rating": {
        "rate": 4.7,
        "count": 500
      }
    },
    {
      "id": "4",
      "title": "Mens Casual Slim Fit abdul",
      "price": "59",
      "description": "The color could be slightly different between on the screen and in practice. / Please note that body builds vary by person, therefore, detailed size information should be reviewed below on the product description. abdulmalik",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71YXzeOuslL._AC_UY879_.jpg",
      "rating": {
        "rate": 2.1,
        "count": 430
      }
    },
    {
      "id": "16",
      "title": "Lock and Love Women's Removable Hooded Faux Leather Moto Biker Jacket",
      "price": 29.95,
      "description": "100% POLYURETHANE(shell) 100% POLYESTER(lining) 75% POLYESTER 25% COTTON (SWEATER), Faux leather material for style and comfort / 2 pockets of front, 2-For-One Hooded denim style faux leather jacket, Button detail on waist / Detail stitching at sides, HAND WASH ONLY / DO NOT BLEACH / LINE DRY / DO NOT IRON",
      "category": "women's clothing",
      "image": "https://fakestoreapi.com/img/81XH0e8fefL._AC_UY879_.jpg",
      "rating": {
        "rate": 2.9,
        "count": 340
      }
    },
    {
      "id": "17",
      "title": "Rain Jacket Women Windbreaker Striped Climbing Raincoats",
      "price": 39.99,
      "description": "Lightweight perfet for trip or casual wear---Long sleeve with hooded, adjustable drawstring waist design. Button and zipper front closure raincoat, fully stripes Lined and The Raincoat has 2 side pockets are a good size to hold all kinds of things, it covers the hips, and the hood is generous but doesn't overdo it.Attached Cotton Lined Hood with Adjustable Drawstrings give it a real styled look.",
      "category": "women's clothing",
      "image": "https://fakestoreapi.com/img/71HblAHs5xL._AC_UY879_-2.jpg",
      "rating": {
        "rate": 3.8,
        "count": 679
      }
    },
    {
      "id": "a7428641-6cf5-40cc-b802-602ecbfb1349",
      "title": "Bamboo Pencil",
      "price": "10",
      "description": "Replace your traditional wooden pencil with this one-of-a-kind alternative. It boasts a writing length of up to 20,000 metres using a graphite tip to emulate the pencil experience perfectly. Plus, with an eraser on the end, you’re free to make mistakes and erase them, just like you would with a regular pencil.",
      "category": "Cloth",
      "image": "https://jowanprint.com/wp-content/uploads/2024/08/pencil.jpg",
      "rating": ""
    },
    {
      "id": "49ef4637-4b86-4484-a070-02ecf00d73b6",
      "title": "Magazine Book ",
      "price": "20",
      "description": "Capture attention with vibrant brochures and bring stories to life with professional book printing tailored to your needs",
      "category": "Materials",
      "image": "https://jowanprint.com/wp-content/uploads/2024/03/book-01.jpg",
      "rating": ""
    },
    {
      "id": "89589a98-eadc-4edb-b5bb-958f414d3a4c",
      "title": "Canvas wooden frame hd",
      "price": "58",
      "description": "Stand out with our sleek and vibrant roll-up printing service, perfect for events, promotions, and presentations. Get noticed with high-quality graphics and durable materials.",
      "category": "Materials",
      "image": "https://jowanprint.com/wp-content/uploads/2024/04/canvas-01.jpg",
      "rating": ""
    },
    {
      "id": "e4668789-7396-440c-907b-9e09b4a40e9a",
      "title": "Envelope Print",
      "price": "45",
      "description": "Personalize your correspondence with professionally printed envelopes. Choose from a range of sizes and finishes to suit your needs.",
      "category": "Materials",
      "image": "https://jowanprint.com/wp-content/uploads/2024/03/envelope-03.jpg",
      "rating": ""
    }
  ]
}